RA4_DA2_50/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          5000;
        startFace       737500;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       742500;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       747500;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       750000;
    }
    front
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          5000;
        startFace       752500;
    }
    back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       757500;
    }
)

// ************************************************************************* //
