RA4_DA2_50/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//NN Configuration

actions
(
	{
	name    porousZone;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0 0.25 0) (0.25 0.75 0.25);
        }
	}
/////////////////////////////////////////////////////////
	{
        name    porousZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set porousZone;
        }
	}
);

// ************************************************************************* //
